import axios from "axios";
import { atom, selector, useRecoilValue } from "recoil";
const keyState = atom({
    key: "keyState",
    default: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2NvdW50X2lkIjoiMTkxMzA4NTA3NyIsImF1dGhfaWQiOiIyIiwidG9rZW5fdHlwZSI6IkFjY2Vzc1Rva2VuIiwic2VydmljZV9pZCI6IjQzMDAxMTQ4MSIsIlgtQXBwLVJhdGUtTGltaXQiOiI1MDA6MTAiLCJuYmYiOjE2NTY3NTg2MjMsImV4cCI6MTY3MjMxMDYyMywiaWF0IjoxNjU2NzU4NjIzfQ.hBj8GHO-DKSx1t8GypFhKiZvb7DrMrrhUXygy4irFso",
});
const data = [
    {
        id: 101000001,
        name: "데이비드 시먼",
    },
    {
        id: 101000051,
        name: "앨런 시어러",
    },
    {
        id: 101000195,
        name: "로비 파울러",
    },
    {
        id: 101000240,
        name: "로이 킨",
    },
    {
        id: 101000241,
        name: "라이언 긱스",
    },
    {
        id: 101000244,
        name: "게리 네빌",
    },
    {
        id: 101000246,
        name: "폴 스콜스",
    },
    {
        id: 101000250,
        name: "데이비드 베컴",
    },
    {
        id: 101000388,
        name: "솔 캠벨",
    },
    {
        id: 101000393,
        name: "테디 셰링엄",
    },
    {
        id: 101000570,
        name: "제이-제이 오코차",
    },
    {
        id: 101000805,
        name: "옌스 레만",
    },
    {
        id: 101000942,
        name: "크리스티안 비에리",
    },
    {
        id: 101001025,
        name: "후이 코스타",
    },
    {
        id: 101001040,
        name: "호베르투 카를루스",
    },
    {
        id: 101001041,
        name: "하비에르 사네티",
    },
    {
        id: 101001075,
        name: "A. 델피에로",
    },
    {
        id: 101001088,
        name: "알레산드로 네스타",
    },
    {
        id: 101001109,
        name: "파올로 말디니",
    },
    {
        id: 101001114,
        name: "로베르토 바조",
    },
    {
        id: 101001116,
        name: "마르셀 드사이",
    },
    {
        id: 101001183,
        name: "파비오 칸나바로",
    },
    {
        id: 101001198,
        name: "필리포 인자기",
    },
    {
        id: 101001201,
        name: "잔프랑코 졸라",
    },
    {
        id: 101001256,
        name: "클라렌스 세이도르프",
    },
    {
        id: 101001397,
        name: "지네딘 지단",
    },
    {
        id: 101001419,
        name: "파트리크 비에이라",
    },
    {
        id: 101001605,
        name: "로베르 피레스",
    },
    {
        id: 101001620,
        name: "에마뉘엘 프티",
    },
    {
        id: 101001625,
        name: "티에리 앙리",
    },
    {
        id: 101001668,
        name: "클로드 마켈렐레",
    },
    {
        id: 101001845,
        name: "올레 군나르 솔샤르",
    },
    {
        id: 101003647,
        name: "미하엘 발락",
    },
    {
        id: 101004000,
        name: "데니스 베르캄프",
    },
    {
        id: 101004202,
        name: "젠나로 가투소",
    },
    {
        id: 101004231,
        name: "히바우두",
    },
    {
        id: 101004833,
        name: "H. 스토이치코프",
    },
    {
        id: 101005003,
        name: "카푸",
    },
    {
        id: 101005099,
        name: "잔루카 잠브로타",
    },
    {
        id: 101005419,
        name: "마이클 오언",
    },
    {
        id: 101005467,
        name: "제이미 캐러거",
    },
    {
        id: 101005471,
        name: "프랭크 램파드",
    },
    {
        id: 101005479,
        name: "카시야스",
    },
    {
        id: 101005589,
        name: "루이스 피구",
    },
    {
        id: 101005673,
        name: "야리 리트마넨",
    },
    {
        id: 101005680,
        name: "P. 클라위베르트",
    },
    {
        id: 101005681,
        name: "M. 오베르마르스",
    },
    {
        id: 101005984,
        name: "다비드 트레제게",
    },
    {
        id: 101006235,
        name: "파벨 네드베드",
    },
    {
        id: 101006975,
        name: "프레디 융베리",
    },
    {
        id: 101007289,
        name: "리오 퍼디난드",
    },
    {
        id: 101007512,
        name: "에르난 크레스포",
    },
    {
        id: 101007518,
        name: "베론",
    },
    {
        id: 101007763,
        name: "안드레아 피를로",
    },
    {
        id: 101007826,
        name: "로빈 반페르시",
    },
    {
        id: 101009676,
        name: "사뮈엘 에토",
    },
    {
        id: 101010264,
        name: "뤼트 반니스텔로이",
    },
    {
        id: 101010535,
        name: "차비",
    },
    {
        id: 101011141,
        name: "미로슬라프 클로제",
    },
    {
        id: 101013038,
        name: "카를레스 푸욜",
    },
    {
        id: 101013128,
        name: "안드리 셰우첸코",
    },
    {
        id: 101013383,
        name: "나카타 히데토시",
    },
    {
        id: 101013743,
        name: "스티븐 제라드",
    },
    {
        id: 101020170,
        name: "비토르 바이아",
    },
    {
        id: 101023174,
        name: "리켈메",
    },
    {
        id: 101028130,
        name: "호나우지뉴",
    },
    {
        id: 101031432,
        name: "디디에 드로그바",
    },
    {
        id: 101034079,
        name: "애슐리 콜",
    },
    {
        id: 101037576,
        name: "호나우두",
    },
    {
        id: 101039943,
        name: "박지성",
    },
    {
        id: 101045661,
        name: "라울",
    },
    {
        id: 101045674,
        name: "마이클 에시앙",
    },
    {
        id: 101046747,
        name: "알렉시 랄라스",
    },
    {
        id: 101048940,
        name: "페트르 체흐",
    },
    {
        id: 101049369,
        name: "페르난도 토레스",
    },
    {
        id: 101051539,
        name: "에드윈 반데르사르",
    },
    {
        id: 101052241,
        name: "헨릭 라르손",
    },
    {
        id: 101053769,
        name: "데쿠",
    },
    {
        id: 101054050,
        name: "웨인 루니",
    },
    {
        id: 101117106,
        name: "파울레타",
    },
    {
        id: 101121939,
        name: "필립 람",
    },
    {
        id: 101121944,
        name: "B. 슈바인슈타이거",
    },
    {
        id: 101138449,
        name: "카카",
    },
    {
        id: 101140601,
        name: "네마냐 비디치",
    },
    {
        id: 101156353,
        name: "루이스 에르난데스",
    },
    {
        id: 101161840,
        name: "페르난도 이에로",
    },
    {
        id: 101166120,
        name: "안드레아스 브레메",
    },
    {
        id: 101166124,
        name: "게오르게 하지",
    },
    {
        id: 101166149,
        name: "우고 산체스",
    },
    {
        id: 101167135,
        name: "카를루스 아우베르투",
    },
    {
        id: 101167198,
        name: "에릭 칸토나",
    },
    {
        id: 101167680,
        name: "로날트 쿠만",
    },
    {
        id: 101177845,
        name: "프랑크 더부르",
    },
    {
        id: 101190044,
        name: "보비 무어",
    },
    {
        id: 101190045,
        name: "요한 크루이프",
    },
    {
        id: 101190046,
        name: "소크라테스",
    },
    {
        id: 101190053,
        name: "페터 슈마이켈",
    },
    {
        id: 101191208,
        name: "차범근",
    },
    {
        id: 101191695,
        name: "부트라게뇨",
    },
    {
        id: 101192181,
        name: "마르코 반바스텐",
    },
    {
        id: 101214098,
        name: "프랑크 레이카르트",
    },
    {
        id: 101214100,
        name: "루드 굴리트",
    },
    {
        id: 101214101,
        name: "파울루 푸트리",
    },
    {
        id: 101214267,
        name: "게리 리네커",
    },
    {
        id: 101214649,
        name: "다보르 슈케르",
    },
    {
        id: 101215558,
        name: "슈테판 에펜베르크",
    },
    {
        id: 101215732,
        name: "올리버 비어호프",
    },
    {
        id: 101222000,
        name: "미카엘 라우드루프",
    },
    {
        id: 101222257,
        name: "브리안 라우드루프",
    },
    {
        id: 101222481,
        name: "로랑 블랑",
    },
    {
        id: 101222680,
        name: "카를로스 발데라마",
    },
    {
        id: 101226764,
        name: "조지 베스트",
    },
    {
        id: 101238380,
        name: "레프 야신",
    },
    {
        id: 101242519,
        name: "에우제비우",
    },
    {
        id: 101243781,
        name: "과르디올라",
    },
    {
        id: 101247515,
        name: "존 반스",
    },
    {
        id: 101247553,
        name: "가린샤",
    },
    {
        id: 101247699,
        name: "케니 달글리시",
    },
    {
        id: 101247703,
        name: "이언 러시",
    },
    {
        id: 101248146,
        name: "이언 라이트",
    },
    {
        id: 101254642,
        name: "페렌츠 푸스카스",
    },
    {
        id: 201000001,
        name: "데이비드 시먼",
    },
    {
        id: 201000041,
        name: "이니에스타",
    },
    {
        id: 201000051,
        name: "앨런 시어러",
    },
    {
        id: 201000195,
        name: "로비 파울러",
    },
    {
        id: 201000240,
        name: "로이 킨",
    },
    {
        id: 201000244,
        name: "게리 네빌",
    },
    {
        id: 201000246,
        name: "폴 스콜스",
    },
    {
        id: 201000388,
        name: "솔 캠벨",
    },
    {
        id: 201000393,
        name: "테디 셰링엄",
    },
    {
        id: 201000488,
        name: "올리버 칸",
    },
    {
        id: 201000570,
        name: "제이-제이 오코차",
    },
    {
        id: 201000805,
        name: "옌스 레만",
    },
    {
        id: 201000942,
        name: "크리스티안 비에리",
    },
    {
        id: 201001025,
        name: "후이 코스타",
    },
    {
        id: 201001040,
        name: "호베르투 카를루스",
    },
    {
        id: 201001041,
        name: "하비에르 사네티",
    },
    {
        id: 201001075,
        name: "A. 델피에로",
    },
    {
        id: 201001088,
        name: "알레산드로 네스타",
    },
    {
        id: 201001109,
        name: "파올로 말디니",
    },
    {
        id: 201001116,
        name: "마르셀 드사이",
    },
    {
        id: 201001179,
        name: "잔루이지 부폰",
    },
    {
        id: 201001183,
        name: "파비오 칸나바로",
    },
    {
        id: 201001198,
        name: "필리포 인자기",
    },
    {
        id: 201001201,
        name: "잔프랑코 졸라",
    },
    {
        id: 201001256,
        name: "클라렌스 세이도르프",
    },
    {
        id: 201001419,
        name: "파트리크 비에이라",
    },
    {
        id: 201001605,
        name: "로베르 피레스",
    },
    {
        id: 201001620,
        name: "에마뉘엘 프티",
    },
    {
        id: 201001625,
        name: "티에리 앙리",
    },
    {
        id: 201003647,
        name: "미하엘 발락",
    },
    {
        id: 201004000,
        name: "데니스 베르캄프",
    },
    {
        id: 201004202,
        name: "젠나로 가투소",
    },
    {
        id: 201004231,
        name: "히바우두",
    },
    {
        id: 201004833,
        name: "H. 스토이치코프",
    },
    {
        id: 201005003,
        name: "카푸",
    },
    {
        id: 201005099,
        name: "잔루카 잠브로타",
    },
    {
        id: 201005419,
        name: "마이클 오언",
    },
    {
        id: 201005479,
        name: "카시야스",
    },
    {
        id: 201005589,
        name: "루이스 피구",
    },
    {
        id: 201005661,
        name: "페르난도 모리엔테스",
    },
    {
        id: 201005680,
        name: "P. 클라위베르트",
    },
    {
        id: 201005681,
        name: "M. 오베르마르스",
    },
    {
        id: 201005740,
        name: "야프 스탐",
    },
    {
        id: 201005984,
        name: "다비드 트레제게",
    },
    {
        id: 201006235,
        name: "파벨 네드베드",
    },
    {
        id: 201006975,
        name: "프레디 융베리",
    },
    {
        id: 201007289,
        name: "리오 퍼디난드",
    },
    {
        id: 201007512,
        name: "에르난 크레스포",
    },
    {
        id: 201007518,
        name: "베론",
    },
    {
        id: 201007743,
        name: "랜던 도노번",
    },
    {
        id: 201007826,
        name: "로빈 반페르시",
    },
    {
        id: 201009014,
        name: "아리언 로번",
    },
    {
        id: 201009676,
        name: "사뮈엘 에토",
    },
    {
        id: 201010264,
        name: "뤼트 반니스텔로이",
    },
    {
        id: 201013038,
        name: "카를레스 푸욜",
    },
    {
        id: 201013128,
        name: "안드리 셰우첸코",
    },
];
const playerState = atom({
    key: "playerState",
    default: "",
});
const playerSelector = selector({
    key: "playerSelector",
    get: async ({ get }) => {
        const key = get(keyState);
        const userInfoUrl = "https://api.nexon.co.kr/fifaonline4/v1.0/users?nickname=페어메르테사커";
        // const response = await axios.get("https://fo4.dn.nexoncdn.co.kr/live/externalAssets/common/playersAction/p101000246.png", {
        const { data } = await axios.get(userInfoUrl, {
            headers: {
                Authorization: key,
            },
        });
        console.log(data);
        return data.nickname;
    },
});

export { keyState, playerState, playerSelector };
